In [3]:
import numpy as np
import sqlite3 as sql

In [4]:
conn=sql.connect('test.db')#链接数据库。
cur=conn.cursor()
conn.close()

dir(conn)
 'close',
 'commit',
 'create_aggregate',
 'create_collation',
 'create_function',
 'cursor',
 'enable_load_extension',
 'execute',
 'executemany',
 'executescript',
 'in_transaction',
 'interrupt',
 'isolation_level',
 'iterdump',
 'load_extension',
 'rollback',
 'row_factory',
 'set_authorizer',
 'set_progress_handler',
 'set_trace_callback',
 'text_factory',
 'total_changes']

dir(cur)
 'arraysize',
 'close',
 'connection',
 'description',
 'execute',
 'executemany',
 'executescript',
 'fetchall',
 'fetchmany',
 'fetchone',
 'lastrowid',
 'row_factory',
 'rowcount',
 'setinputsizes',
 'setoutputsize']

cur.close()
cur.fetchall()

#### 基本上两个方法差不多
    关闭任何一个就可以了。
    油标记录着当前的位置以及获取的东西，只有当真正获取的时候才获取出来

#### 创建一个table

In [5]:
conn=sql.connect('test.db')#链接数据库
#sql.memory()在内存中打开一个。
cur=conn.cursor()
cur.execute('''CREATE TABLE COMPANY
       (ID INT PRIMARY KEY     NOT NULL,
       NAME           TEXT    NOT NULL,
       AGE            INT     NOT NULL,
       ADDRESS        CHAR(50),
       SALARY         REAL);''')
conn.commit()
conn.close()

#### insert

In [6]:
conn=sql.connect('test.db')
c=conn.cursor()
c.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (1, 'Paul', 32, 'California', 20000.00 )");

c.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (2, 'Allen', 25, 'Texas', 15000.00 )");

c.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (3, 'Teddy', 23, 'Norway', 20000.00 )");

c.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (4, 'Mark', 25, 'Rich-Mond ', 65000.00 )")


conn.commit()
print(c.rowcount)
conn.close()

1

#### select

In [7]:
conn=sql.connect('test.db')
c=conn.cursor()
cursor=c.execute('SELECT id,name,address, salary from COMPANY')
for row in cursor:
    print('id=',row[0],row[1],row[2])
conn.close()

id= 1 Paul California
id= 2 Allen Texas
id= 3 Teddy Norway
id= 4 Mark Rich-Mond

#### update company set name='xsj' where id=1

In [9]:
conn=sql.connect('test.db')
c=conn.cursor()
c.execute('UPDATE COMPANY set SALARY=25.0000 where ID=1')
conn.commit()
cursor=conn.execute('SELEct id name, address ,salary from COMPANY')
for row in cursor:
    print(row)
conn.close

(1, 'California', 25.0)
(2, 'Texas', 15000.0)
(3, 'Norway', 20000.0)
(4, 'Rich-Mond ', 65000.0)

#### delete

In [11]:
conn=sql.connect('test.db')
c=conn.cursor()
c.execute('delete from company where id=2')
#c.execute('delete from company')
conn.commit()
conn.close()

In [14]:
conn=sql.connect('test.db')
c=conn.cursor()
c=c.execute('SELECT id,name,address, salary from COMPANY')
for row in c:
    print(row)
conn.close()

(1, 'Paul', 'California', 25.0)
(3, 'Teddy', 'Norway', 20000.0)
(4, 'Mark', 'Rich-Mond ', 65000.0)

#### 删除一个table

conn=sql.connect('test.db')
cur=conn.cursor()
cursor=cur.execute('SELEct id name, address ,salary from COMPANY')
for row in cursor:
    print(row)
conn.close

### pandas to sql

In [19]:
import pandas as pd
#pd.DataFrame.to_sql(self, name, con, flavor=None, schema=None, if_exists='fail', index=True, index_label=None, chunksize=None, dtype=None)

In [21]:
data=np.random.randn(10,10)
df=pd.DataFrame(data,index=pd.date_range('2012-11-2',freq='D',periods=10),columns=list('ABCDEFGHIJ'))
df.head()

,A,B,C,D,E,F,G,H,I,J
2012-11-02,-0.495632,-0.071608,-1.045875,-0.265248,-0.597992,-1.238361,0.040798,-2.103949,-2.139762,-0.919412
2012-11-03,-0.410644,2.150233,-0.119713,-0.668981,0.092262,-1.256823,-1.667439,-0.811156,-0.812454,-1.435065
2012-11-04,0.715904,-0.680826,-1.931398,-0.622511,0.120966,0.288117,-0.822296,-0.398314,0.989119,0.546260
2012-11-05,1.572608,-0.570744,-0.124014,0.092720,0.842912,1.911122,-0.714218,0.315193,-0.074413,1.052270
2012-11-06,-2.068925,0.203234,0.297545,0.171454,-0.059864,0.575762,-1.094246,0.271690,0.137418,-0.544561

In [23]:
conn=sql.connect('test.db')
df.to_sql('df',conn)
conn.commit()
conn.close()

In [24]:
conn=sql.connect('test.db')
cursor=conn.execute('SELEct  A,B,C from df')
for row in cursor:
    print(row)
conn.close

(-0.49563175562495293, -0.07160790050304792, -1.0458750794763245)
(-0.41064443722834343, 2.1502332088567115, -0.11971282378666936)
(0.7159042303037532, -0.6808262584891667, -1.9313984067871397)
(1.5726081538298247, -0.5707444140775886, -0.12401425798045583)
(-2.0689245388083526, 0.20323447553716342, 0.29754456245883903)
(1.0417870191511283, -0.26249916137624374, -2.4327776581384506)
(0.1411724284107741, 0.6437071227829332, 0.7202989633452224)
(-0.41613900437403173, -0.4739302597021167, -0.7453598517930285)
(-0.6646408783443863, -1.4786925409565501, 0.22936282765996266)
(-0.1590197820620114, 0.5344596472716421, -0.14231854936434862)

## how to get the datetime

In [25]:
df['data']=df.index
df.head()

,A,B,C,D,E,F,G,H,I,J,data
2012-11-02,-0.495632,-0.071608,-1.045875,-0.265248,-0.597992,-1.238361,0.040798,-2.103949,-2.139762,-0.919412,2012-11-02
2012-11-03,-0.410644,2.150233,-0.119713,-0.668981,0.092262,-1.256823,-1.667439,-0.811156,-0.812454,-1.435065,2012-11-03
2012-11-04,0.715904,-0.680826,-1.931398,-0.622511,0.120966,0.288117,-0.822296,-0.398314,0.989119,0.546260,2012-11-04
2012-11-05,1.572608,-0.570744,-0.124014,0.092720,0.842912,1.911122,-0.714218,0.315193,-0.074413,1.052270,2012-11-05
2012-11-06,-2.068925,0.203234,0.297545,0.171454,-0.059864,0.575762,-1.094246,0.271690,0.137418,-0.544561,2012-11-06

In [27]:
conn=sql.connect('test.db')
#conn.execute('DROP table rand3')
df.to_sql('rand3',conn)
conn.commit()
cursor=conn.execute('SELEct data, A,B,C from rand3')
for row in cursor:
    print(row)
conn.close()

('2012-11-02 00:00:00', -0.49563175562495293, -0.07160790050304792, -1.0458750794763245)
('2012-11-03 00:00:00', -0.41064443722834343, 2.1502332088567115, -0.11971282378666936)
('2012-11-04 00:00:00', 0.7159042303037532, -0.6808262584891667, -1.9313984067871397)
('2012-11-05 00:00:00', 1.5726081538298247, -0.5707444140775886, -0.12401425798045583)
('2012-11-06 00:00:00', -2.0689245388083526, 0.20323447553716342, 0.29754456245883903)
('2012-11-07 00:00:00', 1.0417870191511283, -0.26249916137624374, -2.4327776581384506)
('2012-11-08 00:00:00', 0.1411724284107741, 0.6437071227829332, 0.7202989633452224)
('2012-11-09 00:00:00', -0.41613900437403173, -0.4739302597021167, -0.7453598517930285)
('2012-11-10 00:00:00', -0.6646408783443863, -1.4786925409565501, 0.22936282765996266)
('2012-11-11 00:00:00', -0.1590197820620114, 0.5344596472716421, -0.14231854936434862)